In [ ]:
# intalação biblioteca pandas
!pip install pandas

In [2]:
# importar a bibliotaca pandas 
import pandas as pd

In [ ]:
# Criando um dicionario no Python 

Dicionario = {
    'A': [1,2,3],
    'B': [-3,-2,-1],
    'C': [0,10,20]
}

# Criando um index para linhas do dicionario 
Label = ['1ª Linha', '2ª Linha', '3ª Linha']

# Criar o Dataframe
Dataframe_01 = pd.DataFrame(Dicionario, index=Label)
print(Dataframe_01)

In [ ]:
# Selecionando a coluna 
Dataframe_01[['A','B']]

In [ ]:
# Selecionando a coluna A e C
Dataframe_01[['A','C']]

In [ ]:
# Criando uma nova coluna no DataFrame
Dataframe_01['Nova Coluna'] = Dataframe_01['A']*Dataframe_01['B']

In [ ]:
# Exibindo o DataFrame
Dataframe_01

In [ ]:
# Exibindo mais de um valor na cecula do Jupyter notebook
a = 5
print(a)
Dataframe_01

In [ ]:
# Excluindo uma coluna do DataFrame 
Dataframe_01.drop('Nova Coluna', axis=1) # Drop exclui a linha do DataFrame

In [ ]:
# Excluindo de forma permanente a coluna do Dataframe
Dataframe_01.drop('Nova Coluna', axis=1, inplace=True) #Drop exclui a coluna do Dataframe

Dataframe_01

In [ ]:
# Localizando uma linha no DataFrame 
Dataframe_01.loc['1ª Linha']

In [ ]:
# Localizando uma linha no DataFrame 
Dataframe_01.loc['2ª Linha']

In [ ]:
# Localizando uma linha no DataFrame 
Dataframe_01.loc['3ª Linha']

In [ ]:
# Localizando linha e coluna 
Dataframe_01.loc [['1ª Linha', '2ª Linha'],['A','B']]

In [ ]:
Dataframe_01.head() # Mostra as 4 primeiras linhas do DataFrame

In [ ]:
Dataframe_01.tail() # Mostra as 4 ultimas linhas do DataFrame

In [37]:
# Localizando linhas pelo indice numerico
Dataframe_01.iloc[2:3] # Linha, Coluna

          A  B   C
3ª Linha  3 -1  20

In [39]:
# Localizando linhas pelo indice numerico
Dataframe_01.iloc[:2] # Linha, Coluna

          A  B   C
1ª Linha  1 -3   0
2ª Linha  2 -2  10

In [40]:
# Criando filtro condicional no DataFrame 
Filtro = Dataframe_01['C'] > 0  # Armazena o resultado na variavél Filtro 
Dataframe_02 = Dataframe_01 [Filtro]

In [41]:
Dataframe_02

          A  B   C
2ª Linha  2 -2  10
3ª Linha  3 -1  20

In [42]:
Dataframe_01 > 0 # Retorna ao usuario onde os numeros são maior que 0

             A      B      C
1ª Linha  True  False  False
2ª Linha  True  False   True
3ª Linha  True  False   True

In [43]:
Filtro

1ª Linha    False
2ª Linha     True
3ª Linha     True
Name: C, dtype: bool

In [47]:
# Criando filtro de duas colunas 
Dataframe_01[(Dataframe_01['A'] > 1) & (Dataframe_01 ['C'] > 0)]

          A  B   C
2ª Linha  2 -2  10
3ª Linha  3 -1  20

In [48]:
# Criando filtro de duas colunas com logica or

Dataframe_01[(Dataframe_01['A'] > 5) | (Dataframe_01 ['C'] > 2)]

          A  B   C
2ª Linha  2 -2  10
3ª Linha  3 -1  20

In [49]:
Dataframe_01

          A  B   C
1ª Linha  1 -3   0
2ª Linha  2 -2  10
3ª Linha  3 -1  20

In [50]:
#Resetando o index do DatFrame 
Dataframe_01.reset_index()

      index  A  B   C
0  1ª Linha  1 -3   0
1  2ª Linha  2 -2  10
2  3ª Linha  3 -1  20

In [51]:
Dataframe_01

          A  B   C
1ª Linha  1 -3   0
2ª Linha  2 -2  10
3ª Linha  3 -1  20

In [ ]:
# Resetando o index do DataFrame de forma definitiva 

Dataframe_01.reset_index(inplace= True)  # Reseta o index na base de dados digitais

In [52]:
Dataframe_01

          A  B   C
1ª Linha  1 -3   0
2ª Linha  2 -2  10
3ª Linha  3 -1  20

In [ ]:
#Excluindo a coluna do index 
Dataframe_01.drop('index', axis=1, inplace=True)

In [ ]:
Dataframe_01

In [55]:
# Criando varios dicionarios 

Dicionario_01 = {
    'A': [1,2,3],
    'B': [-32,-21,-15],
    'C': [60,10,20],
    'Chave': ['AA', 'BB', 'CC']

}

# Dicionario 2

Dicionario_02 = {
    'A': [6,7,8],
    'B': [-39,-28,17],
    'C': [1000,10,60],
    'Chave': ['AA', 'BB', 'CC']
}

# Dicionario 3

Dicionario_03 = {
    'A': [11,12,13],
    'B': [-39,-22,-11],
    'C': [ 30,10,20],
    'Chave': ['AA', 'BB', 'CC']
}

# Criando as listas para serem os labels

Label_01 = ['1ª Linha', '2ª Linha', '3ª Linha']
Label_02 = ['4ª Linha', '5ª Linha', '6ª Linha']
Label_03 = ['7ª Linha', '8ª Linha', '9ª Linha']

# Criando os DataFrames 
Dataframe_01n = pd.DataFrame(Dicionario_01, index=Label_01)
Dataframe_02n = pd.DataFrame(Dicionario_02, index=Label_02)
Dataframe_03n = pd.DataFrame(Dicionario_03, index=Label_03)

In [56]:
Dataframe_01n

          A   B   C Chave
1ª Linha  1 -32  60    AA
2ª Linha  2 -21  10    BB
3ª Linha  3 -15  20    CC

In [57]:
Dataframe_02n

          A   B     C Chave
4ª Linha  6 -39  1000    AA
5ª Linha  7 -28    10    BB
6ª Linha  8  17    60    CC

In [58]:
Dataframe_03n

           A   B   C Chave
7ª Linha  11 -39  30    AA
8ª Linha  12 -22  10    BB
9ª Linha  13 -11  20    CC

In [59]:
# Juntando os DataFrames com concat
# Empilhando os DataFrames 

pd.concat([Dataframe_01n, Dataframe_02n, Dataframe_03n])

           A   B     C Chave
1ª Linha   1 -32    60    AA
2ª Linha   2 -21    10    BB
3ª Linha   3 -15    20    CC
4ª Linha   6 -39  1000    AA
5ª Linha   7 -28    10    BB
6ª Linha   8  17    60    CC
7ª Linha  11 -39    30    AA
8ª Linha  12 -22    10    BB
9ª Linha  13 -11    20    CC

In [60]:
# Juntando DataFrame com merge 

pd.merge (Dataframe_01n, Dataframe_02n, how='inner', on='Chave')

   A_x  B_x  C_x Chave  A_y  B_y   C_y
0    1  -32   60    AA    6  -39  1000
1    2  -21   10    BB    7  -28    10
2    3  -15   20    CC    8   17    60

In [62]:
# Juntando DataFrame com merge 

pd.merge (Dataframe_01n, Dataframe_03n, how='left', on='Chave')

   A_x  B_x  C_x Chave  A_y  B_y  C_y
0    1  -32   60    AA   11  -39   30
1    2  -21   10    BB   12  -22   10
2    3  -15   20    CC   13  -11   20

In [63]:
print(Dataframe_01n)
print(Dataframe_03n)

          A   B   C Chave
1ª Linha  1 -32  60    AA
2ª Linha  2 -21  10    BB
3ª Linha  3 -15  20    CC
           A   B   C Chave
7ª Linha  11 -39  30    AA
8ª Linha  12 -22  10    BB
9ª Linha  13 -11  20    CC

In [64]:
# Juntando DataFrame com merge 

pd.merge (Dataframe_01n, Dataframe_03n, how='right', on='Chave')

   A_x  B_x  C_x Chave  A_y  B_y  C_y
0    1  -32   60    AA   11  -39   30
1    2  -21   10    BB   12  -22   10
2    3  -15   20    CC   13  -11   20

In [65]:
# Juntando DataFrame com merge 

pd.merge (Dataframe_01n, Dataframe_03n, how='outer', on='Chave')

   A_x  B_x  C_x Chave  A_y  B_y  C_y
0    1  -32   60    AA   11  -39   30
1    2  -21   10    BB   12  -22   10
2    3  -15   20    CC   13  -11   20